from tkinter import *
from tkinter import messagebox
import random
from tkinter import ttk

APP = Tk()

APP.title('Group Project')
APP.geometry('1000x600')
APP.config(bg='gray2')

font001_35 = 'Tahoma 35 bold'
font001_20 = 'Tahoma 20 bold'
font001_10 = 'Tahoma 10 bold'
font001_25 = 'Tahoma 25 bold'
font001_50 = 'Tahoma 50 bold'

Int_People = IntVar()

style= ttk.Style()
style.theme_use('clam')
style.configure("TCombobox", fieldbackground= "bisque", background= "bisque")

Label(text='Whatcha',font=font001_35,bg='gray2',fg='green2').place(x=300,y=50)
Label(text='eat?',font=font001_35,bg='gray2',fg='brown2').place(x=540,y=50)

Label(text='How many people',font=font001_20,bg='gray2',fg='sandy brown').place(x=100,y=150)
people = Entry(textvariable=Int_People,font=font001_20,width=20,bg='bisque').place(x=100,y=200)

Label(text='What are you allergic to or do not like?',font=font001_20,bg='gray2',fg='sandy brown').place(x=100,y=260)
allergies_list = ['หมู','ไก่','กุ้ง','อาหารทะเล','เนื้อ','เผ็ด']
allergies = ttk.Combobox(value=allergies_list,width=19,font=font001_20)
allergies.place(x=100,y=310)

def RanMessage():
   manu_normal = ['ข้าวหมกไก่','กระเพราหมูสับ','กระเพราหมูกรอบ','กระเพรากุ้ง','กระเพราปลาหมึก','กระเพราเนื้อ','กระเพราไก่','กระเพราแฮม','กระเพราเบคอน','กระเพราทะเล','กระเพราหอยลาย','เส้นเล็กแห้ง','เส้นเล็กน้ำ','เส้นเล็กต้มยำ','เส้นเล็กหมูตุ๋น','เส้นเล็กเย็นตาโฟ','เส้นใหญ่น้ำ','เส้นใหญ่แห้ง','เส้นใหญ่ต้มยำ','เส้นใหญ่หมูตุ๋น','เส้นใหญ่เย็นตาโฟ','บะหมี่น้ำ','บะหมี่แห้ง','บะหมี่ต้มยำ','บะหมี่หมูตุ๋น','บะหมี่เย็นตาโฟ','เส้นหมี่น้ำ','เส้นหมี่แห้ง','เส้นหมี่ต้มยำ','เส้นหมี่หมูตุ๋น','เส้นหมี่เย็นตาโฟ','หอยลายผัดผงกะหรี่','หมูผัดผงกะหรี่','หมูกรอบผัดผงกะหรี่','ไก่ผัดผงกะหรี่','กุ้งผัดผงกะหรี่','แฮมผัดผงกะหรี่','เบคอนผัดผงกะหรี่','ทะเลผัดผงกะหรี่','หอยลายผัดพริกเผา','หมูผัดพริกเผา','หมูกรอบผัดพริกเผา','ไก่ผัดพริกเผา','กุ้งผัดพริกเผา','ปลาหมึกผัดพริกเผา','แฮมผัดพริกเผา','เบคอนผัดพริกเผา','ทะเลผัดพริกเผา','หมูผัดพริกแกง','หมูกรอบผัดพริกแกง','ไก่ผัดพริกแกง','กุ้งผัดพริกแกง','ปลาหมึกผัดพริกแกง','แฮมผัดพริกแกง','เบคอนผัดพริกแกง','ทะเลผัดพริกแกง','ข้าวเหนียวคอหมูย่าง','ข้าวเหนียวน้ำตกหมู','ข้าวเหนียวส้มตำ','เกาเหลาหมู','ข้าวผัดหมู','ข้าวผัดหมูกรอบ','ข้าวผัดแฮม','ข้าวผัดแหนม','ข้าวผัดเบคอน','ข้าวผัดกุ้ง','ข้าวผัดไก่','ข้าวผัดปลาหมึก','ข้าวผัดต้มยำทะเล','ข้าวผัดต้มกุ้ง','หมูผัดพริกเกลือ','หมูกรอบผัดพริกเกลือ','แฮมผัดพริกเกลือ','เบคอนผัดพริกเกลือ','ไก่ผัดพริกเกลือ','กุ้งผัดพริกเกลือ','ไข่เจียวหอยลาย','ไข่เจียวหมูสับ','ไข่เจียวกุ้ง','ไข่เจียวหมูกรอบ','ไข่เจียวไก่สับ','ไข่เจียวปลาหมึก','คะน้าหมูกรอบ','ผักบุ้งหมูกรอบ','คะน้ากุ้ง','ข้าวมันไก่ต้ม','ข้าวมันไก่ทอด','ข้าวมันไก่ต้ม+ทอด','ข้าวหมูทอดญี่ปุ่น','คัตสึด้ง','ข้าวหน้าปลาแซวม่อน','แฮมเบิร์ก','ข้าวหน้าเนื้อ','ข้าวหน้าหมู','ข้าวหน้าไก่เทอริยากิ','ข้าวแกงกะหรี่หมูทอด','ยากิโซบะ','เส้นใหญ่ราดหน้า','เส้นหมี่ราดหน้า','เส้นใหญ่ผัดซีอิ๊ว','เส้นหมี่ผัดซีอิ๊ว','หมูกระเทียม','หมูกรอบกระเทียม','ไก่กระเทียม','กุ้งกระเทียม','สุกี้ทะเลแห้ง','สุกี้แห้งหมู','สุกี้แห้งไก่','ข้าวยำไก่ทอด','ข้าวยำหมูย่าง','ข้าวหมูแดงหมูกรอบ','มักกะโรนีหมู','มักกะโรนีไก่','มักกะโรนีกุ้ง','มักกะโรนีปลาหมึก','สปาเก็ตตี้หมู','สปาเก็ตตี้ไก่','สปาเก็ตตี้กุ้ง','สปาเก็ตตี้ปลาหมึก']  
   manu_no_pork = ['ข้าวหมกไก่','กระเพรากุ้ง','กระเพราปลาหมึก','กระเพราเนื้อ','กระเพราไก่','กระเพราทะเล','กระเพราหอยลาย','เส้นเล็กแห้ง','เส้นเล็กน้ำ','เส้นเล็กเย็นตาโฟ','เส้นใหญ่น้ำ','เส้นใหญ่แห้ง','เส้นใหญ่เย็นตาโฟ','บะหมี่น้ำ','บะหมี่แห้ง','บะหมี่เย็นตาโฟ','เส้นหมี่น้ำ','เส้นหมี่แห้ง','เส้นหมี่เย็นตาโฟ','หอยลายผัดผงกะหรี่','ไก่ผัดผงกะหรี่','กุ้งผัดผงกะหรี่','ทะเลผัดผงกะหรี่','หอยลายผัดพริกเผา','ไก่ผัดพริกเผา','กุ้งผัดพริกเผา','ปลาหมึกผัดพริกเผา','ทะเลผัดพริกเผา','ไก่ผัดพริกแกง','กุ้งผัดพริกแกง','ปลาหมึกผัดพริกแกง','ทะเลผัดพริกแกง','ข้าวเหนียวส้มตำ','ข้าวผัดกุ้ง','ข้าวผัดไก่','ข้าวผัดปลาหมึก','ข้าวผัดต้มยำทะเล','ข้าวผัดต้มกุ้ง','ไก่ผัดพริกเกลือ','กุ้งผัดพริกเกลือ','ไข่เจียวหอยลาย','ไข่เจียวกุ้ง','ไข่เจียวไก่สับ','ไข่เจียวปลาหมึก','คะน้ากุ้ง','ข้าวมันไก่ต้ม','ข้าวมันไก่ทอด','ข้าวมันไก่ต้ม+ทอด','ข้าวหน้าปลาแซวม่อน','ข้าวหน้าเนื้อ','ข้าวหน้าไก่เทอริยากิ','ยากิโซบะกุ้ง','ไก่กระเทียม','กุ้งกระเทียม','สุกี้ทะเลแห้ง','สุกี้แห้งไก่','ข้าวยำไก่ทอด','มักกะโรนีไก่','มักกะโรนีกุ้ง','มักกะโรนีปลาหมึก','สปาเก็ตตี้ไก่','สปาเก็ตตี้กุ้ง','สปาเก็ตตี้ปลาหมึก']
   manu_no_chicken = ['กระเพราหมูสับ','กระเพราหมูกรอบ','กระเพรากุ้ง','กระเพราปลาหมึก','กระเพราเนื้อ','กระเพราแฮม','กระเพราเบคอน','กระเพราทะเล','กระเพราหอยลาย','เส้นเล็กแห้ง','เส้นเล็กน้ำ','เส้นเล็กต้มยำ','เส้นเล็กหมูตุ๋น','เส้นเล็กเย็นตาโฟ','เส้นใหญ่น้ำ','เส้นใหญ่แห้ง','เส้นใหญ่ต้มยำ','เส้นใหญ่หมูตุ๋น','เส้นใหญ่เย็นตาโฟ','บะหมี่น้ำ','บะหมี่แห้ง','บะหมี่ต้มยำ','บะหมี่หมูตุ๋น','บะหมี่เย็นตาโฟ','เส้นหมี่น้ำ','เส้นหมี่แห้ง','เส้นหมี่ต้มยำ','เส้นหมี่หมูตุ๋น','เส้นหมี่เย็นตาโฟ','หอยลายผัดผงกะหรี่','หมูผัดผงกะหรี่','หมูกรอบผัดผงกะหรี่','กุ้งผัดผงกะหรี่','แฮมผัดผงกะหรี่','เบคอนผัดผงกะหรี่','ทะเลผัดผงกะหรี่','หอยลายผัดพริกเผา','หมูผัดพริกเผา','หมูกรอบผัดพริกเผา','กุ้งผัดพริกเผา','ปลาหมึกผัดพริกเผา','แฮมผัดพริกเผา','เบคอนผัดพริกเผา','ทะเลผัดพริกเผา','หมูผัดพริกแกง','หมูกรอบผัดพริกแกง','กุ้งผัดพริกแกง','ปลาหมึกผัดพริกแกง','แฮมผัดพริกแกง','เบคอนผัดพริกแกง','ทะเลผัดพริกแกง','ข้าวเหนียวคอหมูย่าง','ข้าวเหนียวน้ำตกหมู','ข้าวเหนียวส้มตำ','เกาเหลาหมู','ข้าวผัดหมู','ข้าวผัดหมูกรอบ','ข้าวผัดแฮม','ข้าวผัดแหนม','ข้าวผัดเบคอน','ข้าวผัดกุ้ง','ข้าวผัดปลาหมึก','ข้าวผัดต้มยำทะเล','ข้าวผัดต้มกุ้ง','หมูผัดพริกเกลือ','หมูกรอบผัดพริกเกลือ','แฮมผัดพริกเกลือ','เบคอนผัดพริกเกลือ','กุ้งผัดพริกเกลือ','ไข่เจียวหอยลาย','ไข่เจียวหมูสับ','ไข่เจียวกุ้ง','ไข่เจียวหมูกรอบ','ไข่เจียวปลาหมึก','คะน้าหมูกรอบ','ผักบุ้งหมูกรอบ','คะน้ากุ้ง','ข้าวหมูทอดญี่ปุ่น','คัตสึด้ง','ข้าวหน้าปลาแซวม่อน','แฮมเบิร์ก','ข้าวหน้าเนื้อ','ข้าวหน้าหมู','ข้าวแกงกะหรี่หมูทอด','ยากิโซบะ','เส้นใหญ่ราดหน้า','เส้นหมี่ราดหน้า','เส้นใหญ่ผัดซีอิ๊ว','เส้นหมี่ผัดซีอิ๊ว','หมูกระเทียม','หมูกรอบกระเทียม','กุ้งกระเทียม','สุกี้ทะเลแห้ง','สุกี้แห้งหมู','ข้าวยำหมูย่าง','ข้าวหมูแดงหมูกรอบ','มักกะโรนีหมู','มักกะโรนีกุ้ง','มักกะโรนีปลาหมึก','สปาเก็ตตี้หมู','สปาเก็ตตี้กุ้ง','สปาเก็ตตี้ปลาหมึก']
   manu_no_shrimp = ['ข้าวหมกไก่','กระเพราหมูสับ','กระเพราหมูกรอบ','กระเพราปลาหมึก','กระเพราเนื้อ','กระเพราไก่','กระเพราแฮม','กระเพราเบคอน','กระเพราทะเล','กระเพราหอยลาย','เส้นเล็กแห้ง','เส้นเล็กน้ำ','เส้นเล็กต้มยำ','เส้นเล็กหมูตุ๋น','เส้นเล็กเย็นตาโฟ','เส้นใหญ่น้ำ','เส้นใหญ่แห้ง','เส้นใหญ่ต้มยำ','เส้นใหญ่หมูตุ๋น','เส้นใหญ่เย็นตาโฟ','บะหมี่น้ำ','บะหมี่แห้ง','บะหมี่ต้มยำ','บะหมี่หมูตุ๋น','บะหมี่เย็นตาโฟ','เส้นหมี่น้ำ','เส้นหมี่แห้ง','เส้นหมี่ต้มยำ','เส้นหมี่หมูตุ๋น','เส้นหมี่เย็นตาโฟ','หอยลายผัดผงกะหรี่','หมูผัดผงกะหรี่','หมูกรอบผัดผงกะหรี่','ไก่ผัดผงกะหรี่','แฮมผัดผงกะหรี่','เบคอนผัดผงกะหรี่','ทะเลผัดผงกะหรี่','หอยลายผัดพริกเผา','หมูผัดพริกเผา','หมูกรอบผัดพริกเผา','ไก่ผัดพริกเผา','ปลาหมึกผัดพริกเผา','แฮมผัดพริกเผา','เบคอนผัดพริกเผา','ทะเลผัดพริกเผา','หมูผัดพริกแกง','หมูกรอบผัดพริกแกง','ไก่ผัดพริกแกง','ปลาหมึกผัดพริกแกง','แฮมผัดพริกแกง','เบคอนผัดพริกแกง','ทะเลผัดพริกแกง','ข้าวเหนียวคอหมูย่าง','ข้าวเหนียวน้ำตกหมู','ข้าวเหนียวส้มตำ','เกาเหลาหมู','ข้าวผัดหมู','ข้าวผัดหมูกรอบ','ข้าวผัดแฮม','ข้าวผัดแหนม','ข้าวผัดเบคอน','ข้าวผัดไก่','ข้าวผัดปลาหมึก','ข้าวผัดต้มยำทะเล','หมูผัดพริกเกลือ','หมูกรอบผัดพริกเกลือ','แฮมผัดพริกเกลือ','เบคอนผัดพริกเกลือ','ไก่ผัดพริกเกลือ','ไข่เจียวหอยลาย','ไข่เจียวหมูสับ','ไข่เจียวหมูกรอบ','ไข่เจียวไก่สับ','ไข่เจียวปลาหมึก','คะน้าหมูกรอบ','ผักบุ้งหมูกรอบ','ข้าวมันไก่ต้ม','ข้าวมันไก่ทอด','ข้าวมันไก่ต้ม+ทอด','ข้าวหมูทอดญี่ปุ่น','คัตสึด้ง','ข้าวหน้าปลาแซวม่อน','แฮมเบิร์ก','ข้าวหน้าเนื้อ','ข้าวหน้าหมู','ข้าวหน้าไก่เทอริยากิ','ข้าวแกงกะหรี่หมูทอด','ยากิโซบะ','เส้นใหญ่ราดหน้า','เส้นหมี่ราดหน้า','เส้นใหญ่ผัดซีอิ๊ว','เส้นหมี่ผัดซีอิ๊ว','หมูกระเทียม','หมูกรอบกระเทียม','ไก่กระเทียม','กุ้งกระเทียม','สุกี้ทะเลแห้ง','สุกี้แห้งหมู','สุกี้แห้งไก่','ข้าวยำไก่ทอด','ข้าวยำหมูย่าง','ข้าวหมูแดงหมูกรอบ','มักกะโรนีหมู','มักกะโรนีไก่','มักกะโรนีปลาหมึก','สปาเก็ตตี้หมู','สปาเก็ตตี้ไก่','สปาเก็ตตี้ปลาหมึก']
   manu_no_ocean = ['ข้าวหมกไก่','กระเพราหมูสับ','กระเพราหมูกรอบ','กระเพราเนื้อ','กระเพราไก่','กระเพราแฮม','กระเพราเบคอน','เส้นเล็กแห้ง','เส้นเล็กน้ำ','เส้นเล็กต้มยำ','เส้นเล็กหมูตุ๋น','เส้นเล็กเย็นตาโฟ','เส้นใหญ่น้ำ','เส้นใหญ่แห้ง','เส้นใหญ่ต้มยำ','เส้นใหญ่หมูตุ๋น','เส้นใหญ่เย็นตาโฟ','บะหมี่น้ำ','บะหมี่แห้ง','บะหมี่ต้มยำ','บะหมี่หมูตุ๋น','บะหมี่เย็นตาโฟ','เส้นหมี่น้ำ','เส้นหมี่แห้ง','เส้นหมี่ต้มยำ','เส้นหมี่หมูตุ๋น','เส้นหมี่เย็นตาโฟ','หมูผัดผงกะหรี่','หมูกรอบผัดผงกะหรี่','ไก่ผัดผงกะหรี่','แฮมผัดผงกะหรี่','เบคอนผัดผงกะหรี่','หมูผัดพริกเผา','หมูกรอบผัดพริกเผา','ไก่ผัดพริกเผา','แฮมผัดพริกเผา','เบคอนผัดพริกเผา','หมูผัดพริกแกง','หมูกรอบผัดพริกแกง','ไก่ผัดพริกแกง','แฮมผัดพริกแกง','เบคอนผัดพริกแกง','ข้าวเหนียวคอหมูย่าง','ข้าวเหนียวน้ำตกหมู','ข้าวเหนียวส้มตำ','เกาเหลาหมู','ข้าวผัดหมู','ข้าวผัดหมูกรอบ','ข้าวผัดแฮม','ข้าวผัดแหนม','ข้าวผัดเบคอน','ข้าวผัดไก่','ข้าวผัดต้มยำทะเล','หมูผัดพริกเกลือ','หมูกรอบผัดพริกเกลือ','แฮมผัดพริกเกลือ','เบคอนผัดพริกเกลือ','ไก่ผัดพริกเกลือ','ไข่เจียวหมูสับ','ไข่เจียวหมูกรอบ','ไข่เจียวไก่สับ','ไข่เจียวปลาหมึก','คะน้าหมูกรอบ','ผักบุ้งหมูกรอบ','ข้าวมันไก่ต้ม','ข้าวมันไก่ทอด','ข้าวมันไก่ต้ม+ทอด','ข้าวหมูทอดญี่ปุ่น','คัตสึด้ง','แฮมเบิร์ก','ข้าวหน้าเนื้อ','ข้าวหน้าหมู','ข้าวหน้าไก่เทอริยากิ','ข้าวแกงกะหรี่หมูทอด','ยากิโซบะ','เส้นใหญ่ราดหน้า','เส้นหมี่ราดหน้า','เส้นใหญ่ผัดซีอิ๊ว','เส้นหมี่ผัดซีอิ๊ว','หมูกระเทียม','หมูกรอบกระเทียม','ไก่กระเทียม','สุกี้แห้งหมู','สุกี้แห้งไก่','ข้าวยำไก่ทอด','ข้าวยำหมูย่าง','ข้าวหมูแดงหมูกรอบ','มักกะโรนีหมู','มักกะโรนีไก่','สปาเก็ตตี้หมู','สปาเก็ตตี้ไก่']
   manu_no_meat = ['ข้าวหมกไก่','กระเพราหมูสับ','กระเพราหมูกรอบ','กระเพรากุ้ง','กระเพราปลาหมึก','กระเพราไก่','กระเพราแฮม','กระเพราเบคอน','กระเพราทะเล','กระเพราหอยลาย','เส้นเล็กแห้ง','เส้นเล็กน้ำ','เส้นเล็กต้มยำ','เส้นเล็กหมูตุ๋น','เส้นเล็กเย็นตาโฟ','เส้นใหญ่น้ำ','เส้นใหญ่แห้ง','เส้นใหญ่ต้มยำ','เส้นใหญ่หมูตุ๋น','เส้นใหญ่เย็นตาโฟ','บะหมี่น้ำ','บะหมี่แห้ง','บะหมี่ต้มยำ','บะหมี่หมูตุ๋น','บะหมี่เย็นตาโฟ','เส้นหมี่น้ำ','เส้นหมี่แห้ง','เส้นหมี่ต้มยำ','เส้นหมี่หมูตุ๋น','เส้นหมี่เย็นตาโฟ','หอยลายผัดผงกะหรี่','หมูผัดผงกะหรี่','หมูกรอบผัดผงกะหรี่','ไก่ผัดผงกะหรี่','กุ้งผัดผงกะหรี่','แฮมผัดผงกะหรี่','เบคอนผัดผงกะหรี่','ทะเลผัดผงกะหรี่','หอยลายผัดพริกเผา','หมูผัดพริกเผา','หมูกรอบผัดพริกเผา','ไก่ผัดพริกเผา','กุ้งผัดพริกเผา','ปลาหมึกผัดพริกเผา','แฮมผัดพริกเผา','เบคอนผัดพริกเผา','ทะเลผัดพริกเผา','หมูผัดพริกแกง','หมูกรอบผัดพริกแกง','ไก่ผัดพริกแกง','กุ้งผัดพริกแกง','ปลาหมึกผัดพริกแกง','แฮมผัดพริกแกง','เบคอนผัดพริกแกง','ทะเลผัดพริกแกง','ข้าวเหนียวคอหมูย่าง','ข้าวเหนียวน้ำตกหมู','ข้าวเหนียวส้มตำ','เกาเหลาหมู','ข้าวผัดหมู','ข้าวผัดหมูกรอบ','ข้าวผัดแฮม','ข้าวผัดแหนม','ข้าวผัดเบคอน','ข้าวผัดกุ้ง','ข้าวผัดไก่','ข้าวผัดปลาหมึก','ข้าวผัดต้มยำทะเล','ข้าวผัดต้มกุ้ง','หมูผัดพริกเกลือ','หมูกรอบผัดพริกเกลือ','แฮมผัดพริกเกลือ','เบคอนผัดพริกเกลือ','ไก่ผัดพริกเกลือ','กุ้งผัดพริกเกลือ','ไข่เจียวหอยลาย','ไข่เจียวหมูสับ','ไข่เจียวกุ้ง','ไข่เจียวหมูกรอบ','ไข่เจียวไก่สับ','ไข่เจียวปลาหมึก','คะน้าหมูกรอบ','ผักบุ้งหมูกรอบ','คะน้ากุ้ง','ข้าวมันไก่ต้ม','ข้าวมันไก่ทอด','ข้าวมันไก่ต้ม+ทอด','ข้าวหมูทอดญี่ปุ่น','คัตสึด้ง','ข้าวหน้าปลาแซวม่อน','แฮมเบิร์ก','ข้าวหน้าหมู','ข้าวหน้าไก่เทอริยากิ','ข้าวแกงกะหรี่หมูทอด','ยากิโซบะ','เส้นใหญ่ราดหน้า','เส้นหมี่ราดหน้า','เส้นใหญ่ผัดซีอิ๊ว','เส้นหมี่ผัดซีอิ๊ว','หมูกระเทียม','หมูกรอบกระเทียม','ไก่กระเทียม','กุ้งกระเทียม','สุกี้ทะเลแห้ง','สุกี้แห้งหมู','สุกี้แห้งไก่','ข้าวยำไก่ทอด','ข้าวยำหมูย่าง','ข้าวหมูแดงหมูกรอบ','มักกะโรนีหมู','มักกะโรนีไก่','มักกะโรนีกุ้ง','มักกะโรนีปลาหมึก','สปาเก็ตตี้หมู','สปาเก็ตตี้ไก่','สปาเก็ตตี้กุ้ง','สปาเก็ตตี้ปลาหมึก']
   manu_no_spicy = ['ข้าวหมกไก่','เส้นเล็กแห้ง','เส้นเล็กน้ำ','เส้นเล็กหมูตุ๋น','เส้นเล็กเย็นตาโฟ','เส้นใหญ่น้ำ','เส้นใหญ่แห้ง','เส้นใหญ่หมูตุ๋น','เส้นใหญ่เย็นตาโฟ','บะหมี่น้ำ','บะหมี่แห้ง','บะหมี่หมูตุ๋น','บะหมี่เย็นตาโฟ','เส้นหมี่น้ำ','เส้นหมี่แห้ง','เส้นหมี่หมูตุ๋น','เส้นหมี่เย็นตาโฟ','หอยลายผัดผงกะหรี่','หมูผัดผงกะหรี่','หมูกรอบผัดผงกะหรี่','ไก่ผัดผงกะหรี่','กุ้งผัดผงกะหรี่','แฮมผัดผงกะหรี่','เบคอนผัดผงกะหรี่','ทะเลผัดผงกะหรี่','หอยลายผัดพริกเผา','หมูผัดพริกเผา','หมูกรอบผัดพริกเผา','ไก่ผัดพริกเผา','กุ้งผัดพริกเผา','ปลาหมึกผัดพริกเผา','แฮมผัดพริกเผา','เบคอนผัดพริกเผา','ทะเลผัดพริกเผา','ข้าวเหนียวคอหมูย่าง','ข้าวเหนียวน้ำตกหมู','เกาเหลาหมู','ข้าวผัดหมู','ข้าวผัดหมูกรอบ','ข้าวผัดแฮม','ข้าวผัดแหนม','ข้าวผัดเบคอน','ข้าวผัดกุ้ง','ข้าวผัดไก่','ข้าวผัดปลาหมึก','ข้าวผัดต้มยำทะเล','ข้าวผัดต้มกุ้ง','ไข่เจียวหอยลาย','ไข่เจียวหมูสับ','ไข่เจียวกุ้ง','ไข่เจียวหมูกรอบ','ไข่เจียวไก่สับ','ไข่เจียวปลาหมึก','คะน้าหมูกรอบ','ผักบุ้งหมูกรอบ','คะน้ากุ้ง','ข้าวมันไก่ต้ม','ข้าวมันไก่ทอด','ข้าวมันไก่ต้ม+ทอด','ข้าวหมูทอดญี่ปุ่น','คัตสึด้ง','ข้าวหน้าปลาแซวม่อน','แฮมเบิร์ก','ข้าวหน้าเนื้อ','ข้าวหน้าหมู','ข้าวหน้าไก่เทอริยากิ','ข้าวแกงกะหรี่หมูทอด','ยากิโซบะ','เส้นใหญ่ราดหน้า','เส้นหมี่ราดหน้า','เส้นใหญ่ผัดซีอิ๊ว','เส้นหมี่ผัดซีอิ๊ว','หมูกระเทียม','หมูกรอบกระเทียม','ไก่กระเทียม','กุ้งกระเทียม','สุกี้ทะเลแห้ง','สุกี้แห้งหมู','สุกี้แห้งไก่','ข้าวหมูแดงหมูกรอบ','มักกะโรนีหมู','มักกะโรนีไก่','มักกะโรนีกุ้ง','มักกะโรนีปลาหมึก','สปาเก็ตตี้หมู','สปาเก็ตตี้ไก่','สปาเก็ตตี้กุ้ง','สปาเก็ตตี้ปลาหมึก']

   total = ''

   if Int_People.get() == 0:
      Int_People.set("")
      return messagebox.showwarning("Warning","Error Please try again +_+")
   
   i = 1
   while i <= Int_People.get(): 
      if allergies.get() == 'หมู':
         result = random.choice(manu_no_pork)
      elif allergies.get() == 'ไก่':
         result = random.choice(manu_no_chicken)
      elif allergies.get() == 'กุ้ง':
         result = random.choice(manu_no_shrimp)
      elif allergies.get() == 'อาหารทะเล':
         result = random.choice(manu_no_ocean)
      elif allergies.get() == 'เนื้อ':
         result = random.choice(manu_no_meat)
      elif allergies.get() == 'เผ็ด':
         result = random.choice(manu_no_spicy)
      else:
         result = random.choice(manu_normal)

      total = total + result + ', ' 
   
      #Label(text=result,font=font001_10,bg='black',fg='white').place(x=100,y=400+(30*i))
      i = i + 1

   if Int_People.get() > 0:
      messagebox.showinfo('Foody',total)
      print(total)


Button(command=RanMessage,text='RanDom',cursor='exchange',width='10',height='0',font=font001_20,activebackground='sandy brown',activeforeground='bisque',borderwidth=3, relief="solid",).place(x=100,y=370)

APP.mainloop()